# SQL Basics and Intermediate Concepts

This notebook covers basic and intermediate SQL concepts with working examples.

## Sample Data Setup

In [ ]:

-- Create sample tables

-- Create employees table
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    name VARCHAR(50),
    department_id INT,
    salary DECIMAL(10, 2),
    email VARCHAR(100)
);

-- Insert data into employees
INSERT INTO employees (employee_id, name, department_id, salary, email) VALUES
(1, 'Alice', 1, 60000, 'alice@example.com'),
(2, 'Bob', 2, 70000, 'bob@example.com'),
(3, 'Charlie', 1, 50000, 'charlie@example.com'),
(4, 'David', 3, 90000, 'david@example.com'),
(5, 'Eve', 2, 70000, 'eve@example.com');

-- Create departments table
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(50)
);

-- Insert data into departments
INSERT INTO departments (department_id, department_name) VALUES
(1, 'HR'),
(2, 'Engineering'),
(3, 'Sales');

-- Create sales table
CREATE TABLE sales (
    sale_id INT PRIMARY KEY,
    sale_date DATE,
    sale_amount DECIMAL(10, 2)
);

-- Insert data into sales
INSERT INTO sales (sale_id, sale_date, sale_amount) VALUES
(1, '2025-01-01', 1000.00),
(2, '2025-01-15', 2000.00),
(3, '2025-02-01', 1500.00),
(4, '2025-02-15', 3000.00);

# Basic SQL Concepts

## JOIN Types

In [ ]:

-- Example of JOINs
SELECT employees.name, departments.department_name
FROM employees
INNER JOIN departments ON employees.department_id = departments.department_id;

## WHERE vs HAVING

In [ ]:

-- Example: GROUP BY and HAVING
SELECT department_id, COUNT(*) AS employee_count
FROM employees
GROUP BY department_id
HAVING COUNT(*) > 1;

## Query to Find Duplicate Records

In [ ]:

-- Find duplicate records based on a column (e.g., email)
SELECT email, COUNT(*) AS occurrences
FROM employees
GROUP BY email
HAVING COUNT(*) > 1;

## Retrieve Unique Values

In [ ]:

-- Retrieve unique department names
SELECT DISTINCT department_name
FROM departments;

# Intermediate SQL

## Find the Second-Highest Salary

In [ ]:

-- Second-highest salary
SELECT MAX(salary) AS second_highest_salary
FROM employees
WHERE salary < (SELECT MAX(salary) FROM employees);

## Common Table Expression (CTE)

In [ ]:

-- CTE Example: List departments with more than 1 employee
WITH employee_count AS (
    SELECT department_id, COUNT(*) AS num_employees
    FROM employees
    GROUP BY department_id
)
SELECT *
FROM employee_count
WHERE num_employees > 1;

## Window Functions

In [ ]:

-- ROW_NUMBER Example
SELECT name, department_id, ROW_NUMBER() OVER (PARTITION BY department_id ORDER BY name) AS row_num
FROM employees;

## UNION vs UNION ALL

In [ ]:

-- UNION vs UNION ALL Example
SELECT department_id FROM employees
UNION
SELECT department_id FROM departments;
-- UNION removes duplicates, UNION ALL includes them.

## Total Sales per Month

In [ ]:

-- Total sales per month
SELECT MONTH(sale_date) AS month, SUM(sale_amount) AS total_sales
FROM sales
GROUP BY MONTH(sale_date);